Tekla Open API Reference for Tekla Structures 2025
Part.PartAttributes.SymbolOffset Property
 The symbol offset.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double SymbolOffset { get; set; }
Public Property SymbolOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Part.PartAttributes Class
Tekla.Structures.Drawing Namespace